// start of file - elizadata.js
// data for elizabot.js
// entries prestructured as layed out in Weizenbaum's description
// [cf: Communications of the ACM, Vol. 9, #1 (January 1966): p 36-45.]

// ** Credits: Translation done by Bing AI
"use strict";

exports.elizaInitials = [
	"你好。请告诉我你的问题。",
// additions (not original)
	"请告诉我什么事情困扰着你。",
	"有什么事情困扰你吗？"
];

exports.elizaFinals = [
	"再见。很高兴和你交谈。",
// additions (not original)
	"再见。这次谈话真的很愉快。",
	"再见。我期待我们的下一次会话。",
	"这是一次好的会话，不是吗 -- 但是时间已经结束了。再见。",
	"也许我们可以在下一次会话中更多地讨论这个问题？再见。"
];

exports.elizaQuits = [
	"拜拜",
	"再见",
	"完成",
	"结束",
	"退出"
];

exports.elizaPres = [
	"在吗", "你好",
	"抱歉", "对不起",
	"道歉", "对不起",
	"我错了", "对不起",
	"不好意思", "对不起",
	"姓名", "名字",
	"记住", "想起",
	"追忆", "想起",
	"回忆", "想起",
	"回想", "想起",
	"做梦", "梦想",
	"梦到", "梦想",
	"可能", "也许",
	"很可能", "也许",
	"大概", "也许",
	"的确", "是的",
	"机器", "电脑",
	"计算机", "电脑",
	"曾是", "是",
	"曾经是", "是",
	"过去是", "是",
	"以前是", "是",
	"之前是", "是",
	"你们是", "你是",
	"我们是", "我是",
	"相同", "一样",
	"相当", "一样",
	"相等", "一样",
	"差不多", "一样",
	"一致", "一样",
	"等价", "一样",
	"等于", "一样"
];

exports.elizaPosts = [
	"你的", "我的",
	"我", "你",
	"我自己", "你自己",
	"你自己", "我自己",
	"你", "我",
	"我的", "你的",
	"我是", "你是"
];

exports.elizaSynons = {
	"be": ["是", "曾是", "曾经是", "过去是", "以前是"],
	"belief": ["感到", "认为", "相信", "希望", "期望"],
	"cannot": ["不能", "不能够", "不行"],
	"desire": ["想", "需要"],
	"everyone": ["所有人", "全部人", "大家", "没有人", "没人"],
	"family": ["母", "妈", "父", "爸", "姐", "姊", "妹", "哥", "兄", "弟", "老婆", "妻子", "夫人", "我太太", "丈夫", "老公", "我先生", "孩", "娃"],
	"happy": ["开心", "高兴", "愉悦", "愉快", "舒服"],
	"sad": ["不开心", "沮丧", "难过", "难受", "悲伤", "伤感", "伤痛"]
};

exports.elizaKeywords = [

	/*
	 Array of
	 ["<key>", <rank>, [
	 ["<decomp>", [
	 "<reasmb>",
	 "<reasmb>",
	 "<reasmb>"
	 ]],
	 ["<decomp>", [
	 "<reasmb>",
	 "<reasmb>",
	 "<reasmb>"
	 ]]
	 ]]
	 */

	["xnone", 0, [
		["*", [
			"我不确定我完全理解你。",
			"请继续。",
			"那对你有什么启示？",
			"你强烈地讨论这些事情吗？",
			"那很有趣。请继续。",
			"告诉我更多关于那个的信息。",
			"谈论这个会让你烦恼吗？"
		]]
	]],
	["对不起", 0, [
		["*", [
			"没关系。",
			"别客气。",
			"没事的。",
			"请不要道歉。",
			"不需要道歉。",
			"我已经告诉过你，不需要道歉。",
			"那并没有打扰我。请继续。"
		]]
	]],
	["记得", 5, [
		["* 我记得 *", [
			"你经常想起(2)吗？",
			"想起(2)还会想起什么吗？",
			"你还记得什么？",
			"为什么你现在记得(2)？",
			"现在的情况让你想起了(2)吗？",
			"我和(2)之间有什么联系？",
			"(2)还让你想起了什么？"
		]],
		["* 你记得 *", [
			"你认为我会忘记(2)吗？",
			"你为什么认为我现在应该记得(2)？",
			"关于(2)呢？",
			"goto 什么",
			"你提到了(2)？"
		]],
		["* 你记得 *", [
			"我怎么可能忘记(2)呢？",
			"我应该记住(2)的什么呢？",
			"goto 你"
		]]
	]],
	["忘记", 5, [
		["* 我忘记 *", [
			"你能想出你为什么可能会忘记(2)吗？",
			"为什么你不能记住(2)？",
			"你经常想起(2)吗？",
			"忘记那个会让你烦恼吗？",
			"可能是心理障碍吗？",
			"你总是健忘吗？",
			"你认为你在压抑(2)吗？"
		]],
		["* 你忘记 *", [
			"你为什么问？",
			"你确定你告诉过我吗？",
			"如果我忘记了(2)，你会烦恼吗？",
			"为什么我现在应该记得(2)？",
			"goto 什么",
			"告诉我更多关于(2)的信息。"
		]]
	]],
	["如果", 3, [
		["* 如果 *", [
			"你认为(2)可能吗？",
			"你希望(2)吗？",
			"你对(2)了解多少？",
			"真的，如果(2)？",
			"如果(2)，你会怎么做？",
			"但是(2)的可能性有多大？",
			"这种推测会导致什么？"
		]]
	]],
	["梦想", 4, [
		["* 我梦想 *", [
			"真的，(2)？",
			"你醒着的时候有没有幻想过(2)？",
			"你以前梦见过(2)吗？",
			"goto 梦想"
		]]
	]],
	["梦想", 3, [
		["*", [
			"那个梦对你有什么启示？",
			"你经常做梦吗？",
			"什么人出现在你的梦里？",
			"你认为梦和你的问题有关吗？"
		]]
	]],
	["也许", 0, [
		["*", [
			"你似乎不太确定。",
			"为什么语气不确定？",
			"你不能更肯定一点吗？",
			"你不确定吗？",
			"你不知道吗？",
			"你估计有多大可能性？"
		]]
	]],
	["名字", 15, [
		["*", [
			"我对名字不感兴趣。",
			"我以前告诉过你，我对名字不感兴趣 -- 请继续。"
		]]
	]],
	["deutsch", 0, [
		["*", [
			"goto xforeign",
			"我之前告诉过你，我不懂德语。"
		]]
	]],
	["francais", 0, [
		["*", [
			"goto xforeign",
			"我之前告诉过你，我不懂法语。"
		]]
	]],
	["italiano", 0, [
		["*", [
			"goto xforeign",
			"我之前告诉过你，我不懂意大利语。"
		]]
	]],
	["espanol", 0, [
		["*", [
			"goto xforeign",
			"我之前告诉过你，我不懂西班牙语。"
		]]
	]],
	["english", 0, [
		["*", [
			"goto xforeign",
			"我之前告诉过你，我不懂英语。"
		]]
	]],
	["繁體", 0, [
		["*", [
			"goto xforeign",
			"我之前告诉过你，我（暂时）不懂繁体中文。"
		]]
	]],
	["xforeign", 0, [
		["*", [
			"我只会说（简体）中文。"
		]]
	]],
	["你好", 0, [
		["*", [
			"你好。请告诉我你的问题。",
			"嗨。你遇到什么问题了？"
		]]
	]],
	["电脑", 50, [
		["*", [
			"电脑让你感到困扰吗？",
			"你为什么提到电脑？",
			"你认为机器与你的问题有什么关系？",
			"你不认为电脑可以帮助人们吗？",
			"关于机器，有什么让你担忧的？",
			"你对机器有什么看法？",
			"你不会认为我是一个电脑程序，对吗？"
		]]
	]],
	["是", 0, [
		["* 我是 * 吗 *", [
			"你相信你是(2)吗？",
			"你想成为(2)吗？",
			"你希望我告诉你你是(2)吗？",
			"如果你是(2)，那会意味着什么？",
			"goto what"
		]],
		["* 我是 *", [
			"goto 我"
		]],
		["* 你是 * 吗 *", [
			"你为什么对我是否是(2)感兴趣？",
			"你希望我不是(2)吗？",
			"也许在你的幻想中，我是(2)。",
			"你有时候认为我是(2)吗？",
			"goto what",
			"这对你有关系吗？",
			"如果我是(2)，那又如何？"
		]],
		["* 你是 *", [
			"goto 你"
		]],
		["* 是 *", [
			"你认为他们可能不是(2)吗？",
			"你希望他们不是(2)吗？",
			"如果他们不是(2)，那又如何？",
			"他们总是(2)吗？",
			"可能他们是(2)。",
			"你确定他们是(2)吗？"
		]]
		// ["*", [
		// 	"你为什么说 '你是'？",
		// 	"我不明白。"
		// ]]
	]],
	["你的", 0, [
		["* 你的 *", [
			"你为什么关心我的(2)？",
			"你自己的(2)呢？",
			"你担心别人的(2)吗？",
			"真的，我的(2)？",
			"是什么让你想到我的(2)？",
			"你想要我的(2)吗？"
		]]
	]],
	["曾经是", 2, [
		["* 我曾经是 * 吗 *", [
			"如果你是(2)，那又如何？",
			"你认为你是(2)吗？",
			"你是(2)吗？",
			"如果你是(2)，那会意味着什么？",
			"' (2) '对你来说意味着什么？",
			"goto 什么"
		]],
		["* 我曾经是 *", [
			"你真的是吗？",
			"你为什么现在告诉我你是(2)？",
			"也许我已经知道你是(2)了。"
		]],
		["* 你曾经是 * 吗 *", [
			"你希望相信我是(2)吗？",
			"有什么暗示我是(2)的？",
			"你怎么看？",
			"也许我是(2)。",
			"如果我曾经是(2)，那又如何？"
		]]
	]],
	["我", 0, [
		["* 我 @desire *", [
			"如果你得到(3)，对你意味着什么？",
			"你为什么想要(3)？",
			"假设你很快就能得到(3)。",
			"如果你永远得不到(3)，那又如何？",
			"得到(3)对你意味着什么？",
			"想要(3)与这次讨论有什么关系？"
		]],
		["* 我感到* @sad *", [
			"听到你是(3)，我很遗憾。",
			"你认为来这里会帮助你不再是(3)吗？",
			"我相信成为(3)一定不愉快。",
			"你能解释一下是什么让你变成(3)的吗？"
		]],
		["* 我感到* @happy *", [
			"我是如何帮助你变得(3)的？",
			"你的治疗让你变得(3)了吗？",
			"现在是什么让你(3)？",
			"你能解释一下为什么你突然变得(3)吗？"
		]],
		["* 我曾经是 *", [
			"goto 曾经是"
		]],
		["* 我 @belief 我 *", [
			"你真的这么认为吗？",
			"但你不确定你是(3)。",
			"你真的怀疑你是(3)吗？"
		]],
		["* 我* @belief *你 *", [
			"goto 你"
		]],
		["* 我是 *", [
			"是因为你是(2)，你才来找我吗？",
			"你是(2)多久了？",
			"你认为成为(2)是正常的吗？",
			"你喜欢成为(2)吗？",
			"你知道还有谁是(2)吗？"
		]],
		["* i @cannot *", [
			"你怎么知道你不能(3)？",
			"你试过吗？",
			"也许你现在就能(3)。",
			"你真的想能够(3)吗？",
			"如果你能(3)，那又如何？"
		]],
		["* 我不 *", [
			"你真的不(2)吗？",
			"你为什么不(2)？",
			"你希望能够(2)吗？",
			"这让你困扰吗？"
		]],
		["* 我感到 *", [
			"告诉我更多关于这种感觉的事情。",
			"你经常感到(2)吗？",
			"你喜欢感到(2)吗？",
			"感到(2)让你想起了什么？"
		]],
		["* 我 * 你 *", [
			"也许在你的幻想中，我们(2)彼此。",
			"你想(2)我吗？",
			"你好像很需要(2)我。",
			"你(2)别人吗？"
		]],
		["*", [
			"你说(1)？",
			"你能详细说说吗？",
			"你为什么说(1)？",
			"这很有趣。"
		]]
	]],
	["你", 0, [
		["* 你提醒了我 *", [
			"goto 一样"
		]],
		["* 你是 *", [
			"你为什么认为我是(2)？",
			"你相信我是(2)让你高兴吗？",
			"你有时候希望你是(2)吗？",
			"也许你想成为(2)。"
		]],
		["* 你* 我 *", [
			"你为什么认为我(2)你？",
			"你喜欢认为我(2)你--对吗？",
			"是什么让你觉得我(2)你？",
			"真的，我(2)你？",
			"你希望相信我(2)你吗？",
			"假如我(2)你--那意味着什么？",
			"有别人也认为我(2)你吗？"
		]],
		["* 你 *", [
			"我们在讨论你--不是我。",
			"哦，我(2)？",
			"你不是真的在谈论我--对吗？",
			"你现在的感受是什么？"
		]]
	]],
	["你们", 0, [
		["*", [
			"goto 你"
		]]
	]],
	["是的", 0, [
		["*", [
			"你看起来很肯定。",
			"你很确定。",
			"我明白了。",
			"我理解了。"
		]]
	]],
	["对的", 0, [
		["*", [
			"goto 是的"
		]]
	]],
	["对", 0, [
		["*", [
			"goto 是的"
		]]
	]],
	["没错", 0, [
		["*", [
			"goto 是的"
		]]
	]],
	["不错", 0, [
		["*", [
			"goto 是的"
		]]
	]],
	// ["是", 0, [
	// 	["*", [
	// 		"goto 是的"
	// 	]]
	// ]],
	["不是", 0, [
		["* no one *", [
			"你确定，没有人(2)吗？",
			"肯定有人(2)。",
			"你能想到任何人吗？",
			"你在想一个很特别的人吗？",
			"谁，我可以问吗？",
			"你心里有一个特定的人，对吧？",
			"你觉得你在谈论谁？"
		]],
		["*", [
			"你是不是说不只是为了否定？",
			"你有点消极。",
			"为什么不呢？",
			"为什么'不'？"
		]]
	]],
	["我的", 2, [
		["$ * 我的 *", [
			"这和你的(2)有关吗？",
			"让我们进一步讨论你的(2)。",
			"你之前说过你的(2)。",
			"但是你的(2)。"
		]],
		["* 我的* @family *", [
			"告诉我更多关于你的家庭。",
			"你家里还有谁(4)？",
			"你的(3)？",
			"当你想到你的(3)时，你还想到了什么？"
		]],
		["* 我的 *", [
			"你的(2)？",
			"你为什么说你的(2)？",
			"这是否暗示了你还有其他属于你的东西？",
			"你的(2)对你很重要吗？"
		]]
	]],
	["能", 0, [
		["* 你能 *", [
			"你相信我能(2)吗？",
			"goto 什么",
			"你希望我能(2)。",
			"也许你想自己能(2)。"
		]],
		["* 我能 *", [
			"你能不能(2)取决于你自己，而不是我。",
			"你想能(2)吗？",
			"也许你不想(2)。",
			"goto 什么"
		]]
	]],
	["什么", 0, [
		["*", [
			"你为什么问？",
			"这个问题对你有兴趣吗？",
			"你真正想知道的是什么？",
			"这样的问题经常在你的脑海里吗？",
			"什么答案会让你最满意？",
			"你怎么想？",
			"你问这个问题时，你想到了什么？",
			"你以前问过这样的问题吗？",
			"你问过别人吗？"
		]]
	]],
	["谁", 0, [
		["谁 *", [
			"goto 什么"
		]]
	]],
	["什么时候", 0, [
		["什么时候 *", [
			"goto 什么"
		]]
	]],
	["何时", 0, [
		["*", [
			"goto 什么时候"
		]]
	]],
	["几时", 0, [
		["*", [
			"goto 什么时候"
		]]
	]],
	["哪个时候", 0, [
		["*", [
			"goto 什么时候"
		]]
	]],
	["哪天", 0, [
		["*", [
			"goto 什么时候"
		]]
	]],
	["哪里", 0, [
		["哪里 *", [
			"goto 什么"
		]]
	]],
	["怎么", 0, [
		["怎么 *", [
			"goto 什么"
		]]
	]],
	["如何", 0, [
		["怎么 *", [
			"goto 怎么"
		]]
	]],
	["因为", 0, [
		["*", [
			"那是真正的原因吗？",
			"你没有想到其他的原因吗？",
			"那个原因能解释其他的事情吗？",
			"还有什么可能的原因？"
		]]
	]],
	["为什么", 0, [
		["* 你为什么不 *", [
			"你相信我不(2)吗？",
			"也许我会在适当的时候(2)。",
			"你应该(2)自己吗？",
			"你想让我(2)吗？",
			"goto 什么"
		]],
		["* 我为什么不能 *", [
			"你觉得你应该能(2)吗？",
			"你想能(2)吗？",
			"你相信这会帮助你(2)吗？",
			"你有什么想法，为什么你不能(2)？",
			"goto 什么"
		]],
		["*", [
			"goto 什么"
		]]
	]],
	["所有人", 2, [
		["* @everyone *", [
			"真的，(2)？",
			"肯定不是(2)。",
			"你能想到任何特定的人吗？",
			"比如说，谁？",
			"你在想一个很特别的人吗？",
			"谁，我可以问吗？",
			"也许是一个特别的人？",
			"你心里有一个特定的人，对吧？",
			"你觉得你在谈论谁？"
		]]
	]],
	["任何人", 2, [
		["*", [
			"goto everyone"
		]]
	]],
	["全部人", 2, [
		["*", [
			"goto everyone"
		]]
	]],
	["大家", 2, [
		["*", [
			"goto everyone"
		]]
	]],
	["没有人", 2, [
		["*", [
			"goto 所有人"
		]]
	]],
	["没人", 2, [
		["*", [
			"goto 所有人"
		]]
	]],
	["经常", 1, [
		["*", [
			"你能想到一个具体的例子吗？",
			"什么时候？",
			"你在想什么事情？",
			"真的，总是这样？"
		]]
	]],
	["时常", 2, [
		["*", [
			"goto 经常"
		]]
	]],
	["总是", 2, [
		["*", [
			"goto 经常"
		]]
	]],
	["老是", 2, [
		["*", [
			"goto 经常"
		]]
	]],
	["一样", 10, [
		["*", [
			"在哪些方面？",
			"你看到了什么相似之处？",
			"这种相似性对你意味着什么？",
			"你还看到了什么其他的联系？",
			"你认为这种相似性意味着什么？",
			"你认为有什么联系吗？",
			"真的有某种联系吗？",
			"怎么样？"
		]]
	]],
	["像", 10, [
		["* @be *像 *", [
			"goto 一样"
		]]
	]],
	["不一样", 0, [
		["*", [
			"它有什么不同？",
			"你看到了什么差异？",
			"这种差异对你意味着什么？",
			"你还看到了什么其他的区别？",
			"你认为这种差异意味着什么？",
			"你认为有可能有某种联系吗？",
			"怎么样？"
		]]
	]],
	["不同", 2, [
		["*", [
			"goto 不一样"
		]]
	]],
	["差异", 2, [
		["*", [
			"goto 不一样"
		]]
	]]

];

// ** TODO: Missing translation
// regexp/replacement pairs to be performed as final cleanings
// here: cleanings for multiple bots talking to each other
exports.elizaPostTransforms = [
	/ old old/g, " old",
	/\bthey were( not)? me\b/g, "it was$1 me",
	/\bthey are( not)? me\b/g, "it is$1 me",
	/Are they( always)? me\b/, "it is$1 me",
	/\bthat your( own)? (\w+)( now)? \?/, "that you have your$1 $2 ?",
	/\bI to have (\w+)/, "I have $1",
	/Earlier you said your( own)? (\w+)( now)?\./, "Earlier you talked about your $2."
];

// eof
